; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph1 - mode
	infrared0 - mode
	image3 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation11 - direction
	Star5 - direction
	Star2 - direction
	Star10 - direction
	Star1 - direction
	Star13 - direction
	GroundStation8 - direction
	GroundStation12 - direction
	Star9 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 Star5)
	(supports instrument1 image3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star10)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 Star13)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
)
(:goal (and
	(have_image Planet14 image3)
	(have_image Planet15 infrared2)
	(have_image Planet16 infrared0)
	(have_image Phenomenon17 infrared2)
	(have_image Star18 spectrograph1)
))

)

; plan
1. (turn_to satellite0 groundstation12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation12)
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite0 instrument1 groundstation12)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 planet14 groundstation12)
   deleted: (pointing satellite0 groundstation12)
   added: (pointing satellite0 planet14)
   goals met: 0 of 5
5. (take_image satellite0 planet14 instrument1 image3)
   added: (have_image planet14 image3)
   goals met: 1 of 5
6. (turn_to satellite0 phenomenon17 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 5
7. (take_image satellite0 phenomenon17 instrument1 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 2 of 5
8. (turn_to satellite0 planet15 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet15)
   goals met: 2 of 5
9. (take_image satellite0 planet15 instrument1 infrared2)
   added: (have_image planet15 infrared2)
   goals met: 3 of 5
10. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 5
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 5
12. (turn_to satellite0 star10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star10)
   goals met: 3 of 5
13. (calibrate satellite0 instrument0 star10)
   added: (calibrated instrument0)
   goals met: 3 of 5
14. (turn_to satellite0 planet16 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet16)
   goals met: 3 of 5
15. (take_image satellite0 planet16 instrument0 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 4 of 5
16. (turn_to satellite0 star18 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star18)
   goals met: 4 of 5
17. (take_image satellite0 star18 instrument0 spectrograph1)
   added: (have_image star18 spectrograph1)
   goals met: 5 of 5
